tutorials4NF/validations4NF/PCM_Kamkari/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs ("liblduSolvers.so");

application     phaseChangeMaterial4NF;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         4800;

deltaT          0.1;

writeControl    adjustableRunTime;//timeStep;

writeInterval   600;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.7;

libs ("libnanoFluid4Foam.so");//-nanoFluid4Foam

InfoSwitches
{
    writePrecision  6;
    writeJobInfo    0;
    allowSystemOperations 1;
}

functions
(
    postProcess
    {
        functionObjectLibs	("libutilityFunctionObjects.so");
        type			coded;
        name			postProcess;
        enabled			true;
        outputControl		outputTime;//timeStep
        redirectType		postProcess;

        code
        #{
            std::ofstream output;
            output.open("postProcess.txt",std::ofstream::app);

            const volScalarField& gamma = mesh().lookupObject<volScalarField>("gamma");
            const fvMesh& mesh = gamma.mesh();
            const scalarField& volumeCell = mesh.V();
            scalar meltingFraction = (fvc::domainIntegrate(gamma).value()/sum(volumeCell))*100;

            scalar t_ = gamma.mesh().time().value();
            scalar deltaT_ = gamma.mesh().time().deltaT().value();

            output << t_ << "\t\t" << meltingFraction << "\n";
            output.close();
        #};
    }
);

// ************************************************************************* //
